; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-4-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	)
(:init
	(at plane1 city3)
	(= (capacity plane1) 13676)
	(= (fuel plane1) 1304)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 16)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 3)
	(at plane2 city1)
	(= (capacity plane2) 13503)
	(= (fuel plane2) 3571)
	(= (slow-burn plane2) 5)
	(= (fast-burn plane2) 14)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 4)
	(at plane3 city2)
	(= (capacity plane3) 2738)
	(= (fuel plane3) 263)
	(= (slow-burn plane3) 1)
	(= (fast-burn plane3) 2)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 5)
	(at plane4 city4)
	(= (capacity plane4) 5960)
	(= (fuel plane4) 1917)
	(= (slow-burn plane4) 2)
	(= (fast-burn plane4) 4)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 2)
	(at person1 city0)
	(at person2 city3)
	(at person3 city4)
	(at person4 city1)
	(at person5 city3)
	(at person6 city2)
	(at person7 city4)
	(at person8 city0)
	(at person9 city4)
	(at person10 city0)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 932)
	(= (distance city0 city2) 674)
	(= (distance city0 city3) 895)
	(= (distance city0 city4) 860)
	(= (distance city1 city0) 932)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 531)
	(= (distance city1 city3) 538)
	(= (distance city1 city4) 785)
	(= (distance city2 city0) 674)
	(= (distance city2 city1) 531)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 579)
	(= (distance city2 city4) 506)
	(= (distance city3 city0) 895)
	(= (distance city3 city1) 538)
	(= (distance city3 city2) 579)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 702)
	(= (distance city4 city0) 860)
	(= (distance city4 city1) 785)
	(= (distance city4 city2) 506)
	(= (distance city4 city3) 702)
	(= (distance city4 city4) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city4)
	(at person2 city4)
	(at person3 city1)
	(at person4 city2)
	(at person5 city3)
	(at person6 city4)
	(at person7 city0)
	(at person8 city1)
	(at person9 city0)
	(at person10 city1)
	))

(:metric minimize (+ (* 3 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (board person9 plane4 city4)
   deleted: (at person9 city4)
   added: (in person9 plane4)
   changed: (onboard plane4) from 0 to 1
   goals met: 1 of 10
2. (board person3 plane4 city4)
   deleted: (at person3 city4)
   added: (in person3 plane4)
   changed: (onboard plane4) from 1 to 2
   goals met: 1 of 10
3. (board person4 plane2 city1)
   deleted: (at person4 city1)
   added: (in person4 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 1 of 10
4. (fly plane2 city1 city2)
   deleted: (at plane2 city1)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 0 to 2655, (fuel plane2) from 3571 to 916
   goals met: 1 of 10
5. (debark person4 plane2 city2)
   deleted: (in person4 plane2)
   added: (at person4 city2)
   changed: (onboard plane2) from 1 to 0
   goals met: 2 of 10
6. (board person7 plane4 city4)
   deleted: (at person7 city4)
   added: (in person7 plane4)
   changed: (onboard plane4) from 2 to 3
   goals met: 2 of 10
7. (board person2 plane1 city3)
   deleted: (at person2 city3)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 10
8. (refuel plane1 city3)
   changed: (fuel plane1) from 1304 to 13676
   goals met: 2 of 10
9. (zoom plane1 city3 city4)
   deleted: (at plane1 city3)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 2655 to 13887, (fuel plane1) from 13676 to 2444
   goals met: 2 of 10
10. (debark person2 plane1 city4)
   deleted: (in person2 plane1)
   added: (at person2 city4)
   changed: (onboard plane1) from 1 to 0
   goals met: 3 of 10
11. (refuel plane3 city2)
   changed: (fuel plane3) from 263 to 2738
   goals met: 3 of 10
12. (zoom plane3 city2 city4)
   deleted: (at plane3 city2)
   added: (at plane3 city4)
   changed: (total-fuel-used) from 13887 to 14899, (fuel plane3) from 2738 to 1726
   goals met: 3 of 10
13. (zoom plane3 city4 city2)
   deleted: (at plane3 city4)
   added: (at plane3 city2)
   changed: (total-fuel-used) from 14899 to 15911, (fuel plane3) from 1726 to 714
   goals met: 3 of 10
14. (board person6 plane3 city2)
   deleted: (at person6 city2)
   added: (in person6 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 3 of 10
15. (fly plane3 city2 city4)
   deleted: (at plane3 city2)
   added: (at plane3 city4)
   changed: (total-fuel-used) from 15911 to 16417, (fuel plane3) from 714 to 208
   goals met: 3 of 10
16. (debark person6 plane3 city4)
   deleted: (in person6 plane3)
   added: (at person6 city4)
   changed: (onboard plane3) from 1 to 0
   goals met: 4 of 10
17. (fly plane4 city4 city0)
   deleted: (at plane4 city4)
   added: (at plane4 city0)
   changed: (total-fuel-used) from 16417 to 18137, (fuel plane4) from 1917 to 197
   goals met: 4 of 10
18. (debark person7 plane4 city0)
   deleted: (in person7 plane4)
   added: (at person7 city0)
   changed: (onboard plane4) from 3 to 2
   goals met: 5 of 10
19. (debark person9 plane4 city0)
   deleted: (in person9 plane4)
   added: (at person9 city0)
   changed: (onboard plane4) from 2 to 1
   goals met: 6 of 10
20. (board person1 plane4 city0)
   deleted: (at person1 city0)
   added: (in person1 plane4)
   changed: (onboard plane4) from 1 to 2
   goals met: 6 of 10
21. (board person8 plane4 city0)
   deleted: (at person8 city0)
   added: (in person8 plane4)
   changed: (onboard plane4) from 2 to 3
   goals met: 6 of 10
22. (board person10 plane4 city0)
   deleted: (at person10 city0)
   added: (in person10 plane4)
   changed: (onboard plane4) from 3 to 4
   goals met: 6 of 10
23. (refuel plane4 city0)
   changed: (fuel plane4) from 197 to 5960
   goals met: 6 of 10
24. (fly plane4 city0 city4)
   deleted: (at plane4 city0)
   added: (at plane4 city4)
   changed: (total-fuel-used) from 18137 to 19857, (fuel plane4) from 5960 to 4240
   goals met: 6 of 10
25. (debark person1 plane4 city4)
   deleted: (in person1 plane4)
   added: (at person1 city4)
   changed: (onboard plane4) from 4 to 3
   goals met: 7 of 10
26. (fly plane4 city4 city1)
   deleted: (at plane4 city4)
   added: (at plane4 city1)
   changed: (total-fuel-used) from 19857 to 21427, (fuel plane4) from 4240 to 2670
   goals met: 7 of 10
27. (debark person3 plane4 city1)
   deleted: (in person3 plane4)
   added: (at person3 city1)
   changed: (onboard plane4) from 3 to 2
   goals met: 8 of 10
28. (debark person8 plane4 city1)
   deleted: (in person8 plane4)
   added: (at person8 city1)
   changed: (onboard plane4) from 2 to 1
   goals met: 9 of 10
29. (debark person10 plane4 city1)
   deleted: (in person10 plane4)
   added: (at person10 city1)
   changed: (onboard plane4) from 1 to 0
   goals met: 10 of 10
